{
  "topics": {
    "money": {
      "hindi_term": "पैसा",
      "description": "पैसा वह साधन है जिससे हम चीजें खरीद सकते हैं।",
      "example": "राम ने बाज़ार से सब्ज़ी खरीदने के लिए पैसे दिए।"
    },
    "savings": {
      "hindi_term": "बचत",
      "description": "कमाई में से खर्च निकालने के बाद जो पैसा बचता है, उसे बचत कहते हैं। यह भविष्य की जरूरतों के लिए जरूरी है।",
      "example": "सीता हर महीने 500 रुपये गुल्लक में जमा करती है।"
    },
    "bank": {
      "hindi_term": "बैंक",
      "description": "बैंक वह सुरक्षित जगह है जहाँ हम अपना पैसा जमा कर सकते हैं और जरूरत पड़ने पर निकाल सकते हैं।",
      "example": "मोहन ने अपने पैसे चोरी से बचाने के लिए बैंक में खाता खुलवाया।"
    },
    "loan": {
      "hindi_term": "लोन (उधार)",
      "description": "जब हमें ज्यादा पैसे की जरूरत होती है और हमारे पास नहीं होते, तो हम बैंक से उधार लेते हैं, जिसे लोन कहते हैं। इसे ब्याज के साथ वापस करना होता है।",
      "example": "किसान ने ट्रैक्टर खरीदने के लिए बैंक से लोन लिया।"
    },
    "interest": {
      "hindi_term": "ब्याज",
      "description": "जब हम बैंक में पैसा रखते हैं तो बैंक हमें कुछ अतिरिक्त पैसा देता है, और जब हम लोन लेते हैं तो हमें अतिरिक्त पैसा देना पड़ता है। इसे ब्याज कहते हैं।",
      "example": "राम को बैंक में जमा पैसों पर साल के अंत में 200 रुपये ब्याज मिला।"
    },
    "insurance": {
      "hindi_term": "बीमा",
      "description": "बीमा एक सुरक्षा है जो मुसीबत (बीमारी, दुर्घटना) के समय हमें आर्थिक मदद देती है।",
      "example": "बीमारी के इलाज का खर्च उठाने के लिए सीता ने स्वास्थ्य बीमा लिया।"
    },
    "upi": {
      "hindi_term": "यूपीआई (UPI)",
      "description": "यूपीआई से हम मोबाइल द्वारा तुरंत किसी को भी पैसे भेज सकते हैं।",
      "example": "मोहन ने दुकान पर चाय के पैसे यूपीआई से दिए।"
    },
    "atm": {
      "hindi_term": "एटीएम (ATM)",
      "description": "एटीएम एक मशीन है जिससे हम बिना बैंक गए अपने खाते से पैसे निकाल सकते हैं।",
      "example": "राम ने रात को एटीम से 500 रुपये निकाले।"
    }
  },
  "guidance": {
    "upi_send": {
      "keywords": [
        "upi",
        "bhej",
        "send",
        "transfer",
        "pay",
        "यूपीआई",
        "भेज"
      ],
      "steps": [
        "1. अपना यूपीआई ऐप (जैसे GPay, PhonePe) खोलें।",
        "2. 'Send Money' या 'Scan QR' चुनें।",
        "3. जिसे पैसे भेजने हैं उसका नंबर या यूपीआई आईडी डालें।",
        "4. राशि (Amount) डालें।",
        "5. अपना यूपीआई पिन डालें।",
        "6. पेमेंट सफल होने का संदेश देखें।"
      ],
      "safety": "सावधान: अपना यूपीआई पिन (UPI PIN) कभी किसी को न बताएं, बैंक वाले भी नहीं पूछते।"
    },
    "atm_withdraw": {
      "keywords": [
        "atm",
        "nikal",
        "withdraw",
        "cash",
        "एटीएम",
        "निकाल"
      ],
      "steps": [
        "1. एटीएम मशीन में अपना कार्ड डालें।",
        "2. अपनी भाषा चुनें (Hindi/English)।",
        "3. अपना 4 अंकों का गुप्त पिन डालें।",
        "4. 'Cash Withdrawal' चुनें और राशि डालें।",
        "5. मशीन से पैसे और कार्ड लें।"
      ],
      "safety": "सावधान: पिन डालते समय कीपैड को हाथ से ढंक लें ताकि कोई देख न सके।"
    }
  },
  "decision_support": {
    "loan_decision": {
      "keywords": [
        "loan",
        "chahiye",
        "le",
        "udhar",
        "लोन",
        "उधार",
        "चाहिए"
      ],
      "questions": [
        "क्या आपको सच में इस पैसे की सख्त जरूरत है?",
        "क्या आप हर महीने इसकी किश्त (EMI) चुका पाएंगे?",
        "क्या इससे आपकी कमाई बढ़ेगी (जैसे दुकान, ट्रैक्टर)?"
      ],
      "advice": "लोन तभी लें जब उससे कोई फायदा हो या बहुत मजबूरी हो। शादी या त्योहार के लिए लोन लेने से बचें।"
    },
    "insurance_decision": {
      "keywords": [
        "bima",
        "insurance",
        "policy",
        "suraksha",
        "बीमा",
        "सुरक्षा"
      ],
      "questions": [
        "अगर आपको कुछ हो गया, तो परिवार का खर्च कैसे चलेगा?",
        "क्या आपके पास बीमारी के इलाज के लिए पर्याप्त बचत है?"
      ],
      "advice": "जीवन बीमा और स्वास्थ्य बीमा जरूर कराएं। यह मुसीबत में परिवार का सहारा बनता है।"
    }
  }
}